"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
age = 18 # вік студента
name = "Ivan" # ім'я студента
is_student = True # студент
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name_2 = "John" # змінна не може починатись з цифри
user_age = 25 # використовується стиль snake_case у назвах змінних
price = 100 # спецсимволи не використовуються у назвах змінних
classroom = "Math" # class належить до зарезервованих назв у Python

#**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
max_students_in_group = 30 

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
course_name
course_hours
course_price 


"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
course_expenses = course_hours / course_price

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
#- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
decimal_num = 42
binary_num = 0b101010
hex_num = 0x2A
octal_num = 0o52

"""
#**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""

num_1 = 17 + 5 #сума чисел
num_2 = 17 - 5 #різниця чисел
num_3 = 17 * 5 #добуток чисел
num_4 = 17 / 5 #ділення чисел
num_5 = 17 // 5 #виводить максимальне ціле число при діленні
num_6 = 17 % 5 #показує залишок від ділення
num_7 = 17 ** 5 #підносить до степеню
print(f"{num_1}, {num_2}, {num_3}, {num_4}, {num_5}, {num_6}, {num_7}")

"""
#**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
radius = 7.5
pi = 3.14159
сircle_area = pi * radius ** 2
print (сircle_area)

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
print(50 % 7)
print(50 % 33)
print(14 % 7)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
#зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_area = 436402
azov_sea_area = 37800
total_area = black_sea_area + azov_sea_area
print(total_area)

"""
#**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
full_name = "Ivanov Oleksandr"
print(full_name[0], full_name[-1], len.(full_name))

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
str = "Would you tell me, please, which way I ought to go from here?" 
print(str[0:7], str[-11:])

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
poem = """Чого являєшся мені у сні?
Чого звертаєш ти до мене
Чудові очі ті ясні,
Сумні, немов криниці дно?
Чому уста твої німі?"""
print(poem)


"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
print("Hello" + " " + "world")
str_1 = "Hello"
str_2 = "world"
print(f"{str_1}, {str_2}")
print(f"{str_1}\n{str_2}") 



"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
text = "Вона сказала: \"Привіт!\""
print(text)


"""
#**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
name =input("Введіть ваше ім'я: ")
age =input("Введіть ваш вік: ")
print(f"Привіт, {name}! Тобі {age} років.")

    """

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
#зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
total_photos = 232
page_1 = 8 #8 фото на сторінці
total_pages = total_photos / page_1
print(total_pages)


"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
favorite_color = input("Напишіть улюблений колір: ")
favorite_number = input("Напишіть улюблене число: ")
print(f"Ваш улюблений колір: {favorite_color}, ваше улюблене число: {favorite_number}.")


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
#зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
#250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
total_goods_warehouses = 375291
goods_warehouses_1_2 = 250449
goods_warehouses_2_3 = 222950
goods_warehouse_1 = total_goods_warehouses - goods_warehouses_2_3
goods_warehouse_3 = total_goods_warehouses - goods_warehouses_1_2
goods_warehouse_2 = total_goods_warehouses - (goods_warehouse_1 + goods_warehouse_3)
print(goods_warehouse_1, goods_warehouse_2, goods_warehouse_3)


"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
pay_part = 1179
number_of_parts = 18
total_price = pay_part * number_of_parts
print(total_price)


