# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
    print("world!")

print("Hello", end = " ")
    print("world!")


# task 02  == Виправте назви змінних, щоб текст виводався
hello = "Hello"
world = "world"
print(f"{helo} {word}!")

hello = Hello
world = world
print(f"{hello} {world}!")

# task 03 == Зробіть так, щоб кількість бананів була
# завжди на чотири штуки більша, ніж яблук
apples = 2
banana = apples+4


# task 04 == виправте назви змінних
1_storona = 1
?torona_2 = 2
сторона_3 = 3
$torona_4 = 4

1_storona = 1
2 storona = 2
3 storona = 3
4 storona = 4

# task 05 == Порахуйте периметр фігури з task 04
# та виведіть його для користувача
perimetery = ? + ? + ? + ?
print=(1 storona+2 storona+3 storona+4 storona)


"""
    # Задачі 06 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""

# task 06
"""
У Оксани було 20 марок із серії «Мистецтво» 
і 7 марок із серії «Звірі».
5 марок із серії «Мистецтво» та
1 марку із серії «Звірі» вона подарувала подружці. 
Скільки марок лишилось у Оксани?
"""
marka mystetstvo - 20
marka zviri - 7

print = (marka mystetstvo-5, marka zviri-1)

# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apple - 4
perry- apple+5
plum - apple-2

print (apple+perry+plum)

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?

morning - 5
daytime - morning-10
evening - daytime +4
print (morning+daytime+evening)

"""

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys - 24
girls - boys/2

print =((boys-1) + (girls-2))

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
1 book - 8
2 book -1 book+2
3 book - ((1 book/2) + (2 book/2))

print = (1 book + 2 book + 3 book)
