"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
print(f"*******Завдання 1*******\n")
# код вводити тут
age=43                  # вік студента 
student_name='Olena'    # ім'я студента
is_student =True        # перевірка студент чи ні

print(f"Вік студента - {age}")
print(f"Ім'я студента - {student_name}")
if is_student==True: 
    print(f"Ви студент.\n")
else: 
    print("Ви не студент.\n")
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
print(f"*******Завдання 2*******\n")
name = "John" # змінна не може починатися з цифри
print(f"змінна не може починатися з цифри")
user_age = 25 # не можуть бути використані знаки математичних операцій
print(f"не можуть бути використані знаки математичних операцій")
price = 100 # не може знак долара $ бути використаний  в написані назв змінної 
print(f"не може знак долара $ бути використаний  в написані назв змінної")
classe_subject = "Math" # зарезервовані слова також не можуть бути назвою змінної
print(f"зарезервовані слова також не можуть бути назвою змінної \n")
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
print(f"*******Завдання 3*******\n")
# код вводити тут
max_student=30
print(f"Максимальна кількість студентів у групі - {max_student}\n")
"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
print(f"*******Завдання 4*******\n")
# код вводити тут
course='Python'
course_hours=100
course_price=10000
print(f"Назва курсу {course}. Кількість годин курсу {course_hours}. Вартість курсу складає {course_price} грн.\n")
"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
print(f"*******Завдання 5*******\n")
# код вводити тут
course_hours=100 #кількість годин
course_price=10000 # вартість курсу
course_zatraty=course_hours/course_price
print(f"Затрати курсу : {course_zatraty}\n")
"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
print(f"*******Завдання 6*******\n")
# код вводити тут
desyatkove_chyslo=42
print(f"Десятирічне число: {desyatkove_chyslo}")
# десятирічне число у двійкову систему
dviykove_chyslo=bin(desyatkove_chyslo)
dviykove_chyslo_bez=format(desyatkove_chyslo, 'b')
print(f"Двійкове число: {dviykove_chyslo_bez}")
# десятирічне число у шістнадцяткову систему
shistnadcyatkove_chyslo=hex(desyatkove_chyslo)
shistnadcyatkove_chyslo_bez=format(desyatkove_chyslo, 'x')
print(f"Шістнадцяткове число: {shistnadcyatkove_chyslo_bez}")
# десятирічне число у восьмеричну систему
vosmerychne_chyslo=oct(desyatkove_chyslo)
vosmerychne_chyslo_bez=format(desyatkove_chyslo, 'o')
print(f"Восьмеричне число: {vosmerychne_chyslo_bez} \n")
"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
print(f"*******Завдання 7*******\n")
# код вводити тут
a=17
b=5
# Додаванння
print(f"Сума числел {a} і {b} дорівнює {a+b}")
# Віднімання
print(f"Різниця чисел {a} і {b} дорівнює {a-b}")
# Множення
print(f"Добуток чисел {a} і {b} дорівнює {a*b}")
# Ділення 
print(f"Частка чисел {a} і {b} дорівнює {a/b} ")
# Цілочислене ділення
print(f"Ціла частка від ділення чисел {a} і {b} дорівнює {a//b}")
# Остача від ділення
print(f"Остача від ділення чисел {a} і {b} дорівнює {a % b}")
#Піднесення до степеня
print(f"Піднесення числа {a} до степені {b} дорівнює {a**b} \n")
"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
print(f"*******Завдання 8*******\n")
# код вводити тут
r=7.5
pi=3.14159
s=pi*r**2
print(f"Площа кола з радіусом {r} дорівнює {s}.\n")
"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.

"""
print(f"*******Завдання 9*******\n")
chyslo_1=50
chyslo_2=33
chyslo_3=14
chyslo=7
# залишок від ділення 50 на 7
zalyshok_1=chyslo_1 % chyslo
print(f"Залишок від ділення числа  {chyslo_1} на  {chyslo} дорівнює {zalyshok_1}")
# залишок від ділення 33 на 7
zalyshok_2=chyslo_2 % chyslo
print(f"Залишок від ділення числа  {chyslo_2} на  {chyslo} дорівнює {zalyshok_2}")
# залишок від ділення 14 на 7
zalyshok_3=chyslo_3 % 7
print(f"Залишок від ділення числа  {chyslo_3} на  {chyslo} дорівнює {zalyshok_3} \n")
# код вводити тут

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
print(f"*******Завдання 10*******\n")
chorne_more=436_402
azovske_more=37_800
razom=chorne_more+azovske_more
print(f"З умови задачі відомо, що площа Чорного моря дорівнює {chorne_more} км2, а площа Азовського моря {azovske_more} км2.")
print(f"В заадчі питають, яку площу займає Чорне і Азовське моря разом. ")
print(f"Відповідь: Моря разом займають {razom} км2 \n")
"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут
print(f"*******Завдання 11*******\n")
my_full_name="Olena Zalozna"
print(f"Моє повне ім'я :{my_full_name}") 
#Перший символ
first_symvol=my_full_name[0]
print(f"Перший символ мого повного імені {first_symvol}")
#Останній символ
last_symvol=my_full_name[-1]
print(f"Останній символ мого повного імені {last_symvol} ")
#Довжина рядка
my_name_length=len(my_full_name)
print(f"Довжина рядка мого повного імені {my_name_length}\n")
"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут
print(f"*******Завдання 12*******\n")
ryadok="Would you tell me, please, which way I ought to go from here?"
print(f"Рядок: {ryadok}")
ryadok_first_six=ryadok[0:6]

print(f"Перші шість символів рядка: {ryadok_first_six}")
ryadok_last_eleven= ryadok[-11:]
print(f"Останні 11 символів: {ryadok_last_eleven} \n")
"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
# код вводити тут
print(f"*******Завдання 13*******\n")
zapovit = """
Як умру, то поховайте
Мене на могилі,
Серед степу широкого,
На Вкраїні милій,
Щоб лани широкополі,
І Дніпро, і кручі
Було видно, було чути,
Як реве ревучий.
"""
print(f"zapovit\n")
"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
print(f"*******Завдання 14*******\n")
str1="Hello"
str2="World!"
#з пробілом
print(f"{str1} {str2}\t")
#з комою
print(f"{str1},{str2} \t")
# з новим рядком
print(f"{str1} \n{str2}\n")
"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
print(f"*******Завдання 15*******\n")
ryadok="Створіть рядок з символами, які потребують екранування (\"лапки\", \\зворотна коса риска\\)."
print(f"{ryadok}\n")
"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут
print(f"*******Завдання 16*******\n")
name_user=input("Ваше ім'я:")
age_user=input("Ваш вік:")
print(f"Привіт, {name_user}! Тобі {age_user} років.\n")
"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут
print(f"*******Завдання 17*******\n")
total_photo=232
odna_storinka=8
potribno=total_photo//odna_storinka

print(f"З умови задачі відомо, Ігор займається фотографією.Він вирішив зібрати всі свої {total_photo} фотографії та вклеїть в альбом." )
print(f"На одній сторінці може бути щонайменше {odna_storinka} фото. Скільки сторінок знадобиться Ігорю, щоб вклеїти усі фото?")
print(f"Розв'язок: загальну кільксть фото {total_photo} поділимо на кількість фото, які можуть бути розміщені на одній сторінці {odna_storinka} і отримаємо {potribno} сторінок.")
print(f"Відповідь: Ігорю знадобиться {potribno} сторінок.\n")
"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
print(f"*******Завдання 18*******\n")
colour_like=input("Ваш улюблений колір:")
chyslo_like=input("Ваше улюблене число:")
chyslo_like_int=int(chyslo_like) # перетворюємо тип дани рядок на ціле число
print(f"Ваш улюблений колір {colour_like}, а улюблене число це {chyslo_like_int}.\n ")

"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
# код вводити тут
print(f"*******Завдання 19*******\n")
total_tovariv=375_291
tovariv_first_second=250_449
tovariv_second_third=222_950
tovariv_first=total_tovariv-tovariv_second_third # товарів на 1 складі
tovariv_third=total_tovariv-tovariv_first_second #товарів на 3 складі
#1-й варінт товарів на другому складі
tovariv_second=tovariv_first_second-tovariv_first 
#2-й варіант товарів на другому складі
tovariv_second=tovariv_second_third-tovariv_third
#3-й варіант товарів на другому складі
tovariv_second=total_tovariv-(tovariv_first+tovariv_third)

print(f"Усього на складі {total_tovariv} товарів.\n")
print(f"Перша дія. Знайдемо товарів на першому складі. Від усіх товарів {total_tovariv} віднімемо ті, які на другому і третьому складах {tovariv_second_third}. Отримаємо {tovariv_first} товарів.")
print(f"Друга дія. Знайдемо товарів на третьому складі. Від усіх товарів {total_tovariv} віднімемо ті, які на першому і другому складах {tovariv_first_second}. Отримаємо {tovariv_third} товарів.")
print(f"Третя дія. Маємо три варіанти як знайти товарів на другому складі.\n")
print(f"1-й варіант. Від товарів на першому і другому складах {tovariv_first_second} віднімемо товари на першому складі {tovariv_first}. Отримаємо {tovariv_second} товарів.")
print(f"2-й варіант. Від товарів на другому і третьому складах {tovariv_second_third} віднімемо товари на третьому складі {tovariv_third}. Отримаємо {tovariv_second} товарів.")
print(f"3-й варіант. Від усіх товарів {total_tovariv} віднімемо суму товарів на на першому складі {tovariv_first} і третьому складі {tovariv_third}.Отримаємо {tovariv_second} товарів.")
print(f"Відповідь: на першому складі - {tovariv_first} товарів, на другому складі - {tovariv_second} товарів, на третьому складі - {tovariv_third} товарів.\n")
"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
# код вводити тут
print(f"*******Завдання 20*******\n")
month_plata=1179 #оплата щомісяця
month_kilkist=18 # 1,5 роки це 12+6=18 місяців
#вартість комп'ютера
total_plata_18month=month_plata*month_kilkist
print(f"Михайло разом з татом вирішили купити комп'ютер, скориставшись послугою 'Оплата частинами'. Помісячний платіж складає {month_plata} грн. Кількість місяців до повного погашення кредити складає {month_kilkist} місяців.")
print(f"Повна вартість комп'ютера дорівнює {month_plata}*{month_kilkist}={total_plata_18month} (грн.)")
print(f"Відповідь: вартість комп'ютера складає {total_plata_18month}грн.")