"""
У Python змінна дозволяє посилатися на значення за допомогою імені. 
Щоб створити змінну x із значенням 5, використовуйте =, як у цьому прикладі:
x = 5
Тепер ви можете використовувати ім'я цієї змінної, x, замість фактичного значення, 5.
Пам'ятайте, що = у Python означає присвоювання, а не перевірку рівності! 
Спробуйте це в вправі, замінивши ____ своїм кодом.

Створіть змінну savings із значенням 100.
Перевірте цю змінну, ввівши print(savings) у скрипті.
"""
# Створіть змінну savings із значенням 100.
savings = 100
# Перевірте цю змінну, ввівши print(savings)
print(savings)