print("task 01 \n")
# task 01 == Виправте синтаксичні помилки
print("Hello", end= " ")
print("world!")

print("task 02 \n")
# task 02  == Виправте назви змінних, щоб текст виводався
hello = "Hello"
world = "world"
print(f"{hello} {world}!")

print("task 03 \n")
# task 03 == Зробіть так, щоб кількість бананів була
# завжди на чотири штуки більша, ніж яблук
apples = 2
banana = apples+4 # код тут


# task 04 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 05 == Порахуйте периметр фігури з task 04
# та виведіть його для користувача
perimetery = storona_1 + storona_2+ storona_3 + storona_4
print(perimetery)


"""
    # Задачі 06 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
print("task 06 \n")
# task 06
"""
У Оксани було 20 марок із серії «Мистецтво» 
і 7 марок із серії «Звірі».
5 марок із серії «Мистецтво» та
1 марку із серії «Звірі» вона подарувала подружці. 
Скільки марок лишилось у Оксани?
"""
# Спочатку було
mystectvo=20
zviri=7

# Подарувала
podaruvala_mystectvo=5
podaryvala_zviri=1

# Залишилось
zalushilos_mustectvo=mystectvo-podaruvala_mystectvo
zalushiloc_zviri=zviri - podaryvala_zviri

#Всього марок залишилось у Оксани
vsjogo_zalushulos=zalushilos_mustectvo + zalushiloc_zviri

print(f"У Оксани було {mystectvo} марок із серії 'Мистецтво' і {zviri} марок із серії 'Звірі'.")
print(f"{podaruvala_mystectvo} марок із серії 'Мистецтво' та {podaryvala_zviri} марку із серії 'Звірі' вона подарувала подружці. ")
print(f"Скільки марок лишилось у Оксани?\n")
print(f"Після того,як Оксана подарувала {podaruvala_mystectvo} марок 'Мистецтво' подружці, в неї залишилось {zalushilos_mustectvo} марок 'Мистецтво'")
print(f"Після того, як Оксана подарувала {podaryvala_zviri} марку 'Звірі', в неї залишилось {zalushiloc_zviri} марок 'Звірі'")
print(f"Якщо додати {zalushilos_mustectvo} марок 'Мистецтво', ті що залишились у Оксани до {zalushiloc_zviri} марок 'Звірі' ті що залишились, отримаємо  {vsjogo_zalushulos} марка залишилась у Оксани . \n")

print("task 07 \n")
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apple=4  #4 яблоні
# pear
pear=apple+5  #груш на 5 більше ніж яблук

# plum
plum=apple-2  # слив на 2 менше

# total

total=apple+pear+plum

print(f"У саду посадили {apple} яблуні. Груш на 5 більше яблунь, а слив - на 2 менше. Скільки всього дерев посадили в саду?\n")
print(f"Знайдемо скільки посадили груш, а це з умови на 5 більше ніж яблук. До {apple} додамо 5. Отримаємо {pear} груш.")
print(f"Тепер знайдемо скільки посадили слив. З умов їх на 2 менше ніж яблук. Маємо {plum} сливи.")
print(f"Щоб дізнатися скільки всього дерев посадили у садку, виконаємо дію додавання. Додамо кількість яблук, груш і слив. Отже, всього в саду посадили {total} дерев.\n")

print("task 08 \n")
# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
#вранці
morning_grad=0+5
#після обіду
afternoon_grad=morning_grad-10
#надвечір
evening_grad=afternoon_grad+4
print(f"До обіда температура повітря була на 5 градусів вище нуля. Після обіду температура опустилася на 10 градусів. Надвечір потепліло на 4 градуси. Яка температура надвечір?\n")
print(f"З умови відомо, що температура вранці дорівнює +{morning_grad} градусів. Після обіду вона опустилась на 10 градусів. Отже,виконаємо віднімання від +{morning_grad} градусів 10 градусів,отримаємо  {afternoon_grad} градусів.")
print(f"Надвечір температура піднялась на 4 градуси. Отже,додамо до {afternoon_grad} градусів 4 градуси. Температура надвечір дорівнювала {evening_grad} градус.\n")

print("task 09 \n")
# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boy=24
girl=int(boy/2)
today_boy=boy-1
today_girl=girl-2
total=today_boy+today_girl

print(f"Взагалі у театральному гуртку - {boy} хлопчики, а дівчаток - вдвічі менше. 1 хлопчик захворів та 2 дівчинки не прийшли сьогодні. Скількі сьогодні дітей у театральному гуртку?\n")
print(f"Дівчаток в гурку вдічі менше ніж хлопців. З умови відомо, що  хлопчиків 24, тоді дівчаток всього {girl}. \n")
print(f"Сьогодні прийшло {today_boy}, а дівчаток - {today_girl}. Отже, в театральному гуртку сьогодні {total} дітей.")


print("task 10 \n")
# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
first_book_prise=8
second_book_prise=first_book_prise+2
third_book_prise=(first_book_prise+second_book_prise)/2
total_book_prise=first_book_prise+second_book_prise+third_book_prise
print(f"Перша книжка коштує {first_book_prise} грн., друга - на 2 грн. дорожче,а третя - як половина вартості першої та другої разом. Скільки будуть коштувати усі книги, якщо купити по одному примірнику?\n")
print("Щоб дізнатися скільки будуть коштувати три книги разом, потрібно знайти вартість кожної з них.\n")
print(f"Перша книжка коштує {first_book_prise} грн., з умови. Друга на 2 грн. дорожче. Додамо до вартості першої книжки 2 і отримаємо {second_book_prise} грн.\n")
print(f"Третя книжка коштує, половина вартості перщої {first_book_prise} грн. і другої {second_book_prise} грн. І дорівнює  - {third_book_prise} грн.\n")   
print(f"Загальна вартість трьох книжок дорівню {first_book_prise}+{second_book_prise}+{third_book_prise}={total_book_prise} грн.")