# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02  == Виправте назви змінних, щоб текст виводився
hello = "Hello"
world = "world"
print(f"{hello} {world}!")

# task 03 == Зробіть так, щоб кількість бананів була
# завжди на чотири штуки більша, ніж яблук
apples = 2
banana = apples + 2 # код тут

# task 04 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 05 == Порахуйте периметр фігури з task 04
# та виведіть його для користувача
perimeter = storona_1 + storona_2 + storona_3 + storona_4
print(perimeter)

"""
    # Задачі 06 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""

# task 06
"""
У Оксани було 20 марок із серії «Мистецтво» 
і 7 марок із серії «Звірі».
5 марок із серії «Мистецтво» та
1 марку із серії «Звірі» вона подарувала подружці. 
Скільки марок лишилось у Оксани?
"""

# було
start_art = 20 # «Мистецтво»
start_animals = 7 # «Звірі»

# подарувала
gift_art = 5
gift_animals = 1

# залишилося
end_art = start_art - gift_art # 20 - 5 = 15
end_animals = start_animals - gift_animals # 7 - 1 = 6

# всього
end_total_stamp = end_art + end_animals # 15 + 6 = 21

# задача
# print("Задача 6. У Оксани було", start_art, "марок із серії «Мистецтво» і", start_animals, "марок із серії «Звірі».", gift_art, "марок із серії «Мистецтво» та", gift_animals, "марку із серії «Звірі» вона подарувала подружці. Скільки марок лишилось у Оксани?")

# відповідь
print("Відповідь 6: у Оксани залишилось", end_art, "марок із серії «Мистецтво» і", end_animals, "марок із серії «Звірі». Всього", end_total_stamp, "шт.")

# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""

apple = 4 # яблуні
pear = apple + 5 # груш на 5 більше від яблунь: 4 + 5 = 9
plum = apple - 2 # слив на 2 менше від яблунь (не вказано що від груш): 4 - 2 = 2
total_trees = apple + pear + plum # всього: 4 + 9 + 2 = 15

# print("Задача 7. У саду посадили", apple, "яблуні. Груш на 5 більше яблунь, а слив - на 2 менше. Скільки всього дерев посадили в саду?")
      
print("Відповідь 7: у саду посадили", apple, "яблуні,", pear, "груш і", plum, "сливи. Всього", total_trees, "дерев.")

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""

before_noon = 0 + 5 # 5
afternoon = before_noon - 10 # 5 - 10 = -5
evening = afternoon + 4 # -5 + 4 = -1

# print("температура повітря до обіда", before_noon, "градусів")
# print("температура повітря після обіду", afternoon, "градусів")
print("Відповідь 8: надвечір температура повітря", evening, "градус.")

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скільки сьогодні дітей у театральному гуртку?
"""

boys = 24
girls = boys // 2 # 24 : 2 = 12
absent_boys = 1
absent_girls = 2
kids_today = boys + girls - absent_boys - absent_girls # 24 + 12 - 1 - 2 = 33

print("Відповідь 9: сьогодні у театральному гуртку", kids_today, "дітей.")

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дорожче,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""

book_1 = 8
book_2 = book_1 + 2 # 8 + 2 = 10
book_3 = (book_1 + book_2) // 2 # (8 + 10) : 2 = 9
total_cost = (book_1 + book_2 + book_3) * 1 # (8 + 10 + 9) x 1 = 27

print("Відповідь 10: вартість усіх книг якщо купити по одному примірнику", total_cost, "гривень.")